# homework3!!!!

# დავალება 1:
#  დაწერეთ პროგრამა რომელიც მომხმარებელს ჰკითხავს წონას(კგ) და სიმაღლეს(მ), შეყვანილი მონაცემების 
# საფუძველზე გამოითვლის BMI-ს(Body Mass Index). ფორმულა: წონა გაყოფილი სიმაღლის კვადრატზე
# თუ BMI ნაკლებია 19-ზე, გამოიტანეთ ინფო რომ ის არის underweight
# თუ BMI არის 19 და 25 შორის, გამოიტანეთ ინფო რომ ის არის normalweight
# თუ BMI მეტია 25-ზე, გამოიტანეთ ინფო რომ ის არის overweight


weight = int(input("input your weigth in KG: "))
height = float(input("input your height in Meter: "))

BMI = weight / (height ** 2) 
if BMI < 19:
    print("you are underweight")
elif 19 <= BMI <= 26:
    print("you are not normalweight")
elif BMI > 26:
    print("you are overweight")


# დავალება 2:
# დაწერეთ პროგრამა, რომელიც მომხმარებელს შეეკითხება რიცხვს და გამოითვლის არ რიცხვის ფაქტორიალს, შეგახსენებთ რომ ფაქტორიალი 
# არის ამ რიცხვის ნამრავლი ყველა მთელ რიცხვზე 1-მდე, ანუ 5-ის ფაქტორიალი არის 5 X 4 X 3 X 2 X 1 (დაწერეთ for ლუპის გამოყენებით)

number = int(input("input the number: ")) 

if number == 0:
    print("რიცხვის ფაქტორიალი არის 0")
elif number == 1:
    print("რიცხვის ფაქტორიალი არის 1")
elif number < 0 :
    print("გთხოვთ შეიტანეთ დადებითი რიცხვი")
else: 
    factorial = 1
    for i in range(2, number + 1):
        factorial *= i
    print(f"ფაქტორიალი არის: {factorial}")


# დვალება 3:  დაწერეთ გამრავლების ტაბულა, მაგალითად ასეთი სახით:

for i in range(1, 10):
    for j in range (1, 10):
        print(f"{i} * {j} = {i * j} ")


# დვალება 4:
# ჩავთვალოთ რომ გვაქვს აპარატი, რომელშიც უნდა გადავიხადოთ რაღაც სერვისის გადასახადი, რომლის ღირებულებაც არის 50 ლარი,
# ხოლო აპარატი იღებს მხოლოდ 5, 10 და 20 ლარიან კუპიურებს და გვიბრუნებს ასევე ხურდას.

# დაწერეთ პროგრამა, რომელიც ბეჭდავს გადასახადი თანხის ოდენობას, შემდეგ მომხმარებელს სთხოვს მოათავსოს კუპიურა, თუ კუპიურა არ არის ვალიდური,
# დაბეჭდოს რომ შეიტანოს ვალიდური კუპიურა. თუ კუპიურა ვალიდურია, დაბეჭდოს რაც დარჩა გადასახდელი თანხა და კვლავ სთხოვოს მომხმარებელს კუპიურის 
# მოთავსება, მანამ სანამ, გადასახდელი თანხა არ განულდება. ბოლოს კი დაუწეროს რამდენი ეკუთვნის ხურდა. ანუ ბოლო იტერაციაზე თუ დარჩენილია 
# მაგალითად გადასახდელი თანხა 10 ლარი და მომხმარებელი შეიტანს 20 ლარიანს, დაუწეროს რომ ეკუთვნის 10 ლარი ხურდა.
total_price = 50
valid_bills = [5, 10, 20]
paid_money = 0
while total_price > paid_money: 
    bill = int(input("შეიტანეთ მხოლოდ 5, 10 და 20 ლარიანი კუპიურები: "))
    if bill not in valid_bills:
        print("გთხოვთ შეიტანეთ ვალიდური: 5, 10 ან 20 ლარიანი კუპიურა")
        continue
    paid_money += bill

    if total_price > paid_money:
        print(f"წარმატებით გადახდისათვის დარჩენილია თანხაა {total_price - paid_money} ლარი")

if paid_money == total_price:
    print(f"თქვენ წარმატებით გადაიხადეთ {paid_money} ლარი")
if paid_money > total_price:
    print(f"გადახდა წარმატებით დასრულდა, თქვენ გეკუთვნით {paid_money - total_price} ლარი")







